# Naive Bayes - Part 1

In [7]:
import pandas as pd
df = pd.read_csv('E:\\DataSets\\titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Dropping all the Irrelevant Columns

In [8]:
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns',inplace=True)
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

## Dividign the DataFrame into Inputs and Target

In [ ]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

## Replaciing Sex Column with codes using One Hot Encoding

In [11]:
dummies = pd.get_dummies(inputs.Sex)a
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [13]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [15]:
inputs.drop('Sex',axis='columns', inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

## Finding and Replacing any NaN values in the DataFrame

In [17]:
inputs.columns[inputs.isna().any()] # to find any NaN value in the dataframe

Index(['Age'], dtype='object')

In [18]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [20]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())# fill NaN with average age
inputs.Age = inputs.Age.astype(int) # convert the Age column from float to int
inputs.head(10)

   Pclass  Age     Fare  female  male
0       3   22   7.2500       0     1
1       1   38  71.2833       1     0
2       3   26   7.9250       1     0
3       1   35  53.1000       1     0
4       3   35   8.0500       0     1
5       3   29   8.4583       0     1
6       1   54  51.8625       0     1
7       3    2  21.0750       0     1
8       3   27  11.1333       1     0
9       2   14  30.0708       1     0

## Spliting the Dataset into Train and Test

In [22]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs, target, test_size=0.2)

In [24]:
len(X_train)

712

In [25]:
len(X_test)

179

In [26]:
len(inputs)

891

## Applying Naive Bayes Model

In [27]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB() #Gaussian Naive Bayes is used when the data distribution in the dataset is normal or gaussian distribution
                        # or bell curve

In [28]:
model.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [29]:
model.score(X_test, y_test)

0.7877094972067039

In [30]:
X_test[:10]

     Pclass  Age     Fare  female  male
113       3   20   9.8250       1     0
345       2   24  13.0000       1     0
620       3   27  14.4542       0     1
186       3   29  15.5000       1     0
522       3   29   7.2250       0     1
72        2   21  73.5000       0     1
847       3   35   7.8958       0     1
751       3    6  12.4750       0     1
811       3   39  24.1500       0     1
635       2   28  13.0000       1     0

In [31]:
y_test[:10]

113    0
345    1
620    0
186    1
522    0
72     0
847    0
751    1
811    0
635    1
Name: Survived, dtype: int64

In [32]:
model.predict(X_test[:10])

array([1, 1, 0, 1, 0, 0, 0, 0, 0, 1], dtype=int64)

In [33]:
model.predict_proba(X_test[:10])

array([[0.05659413, 0.94340587],
       [0.02990904, 0.97009096],
       [0.98965525, 0.01034475],
       [0.06748238, 0.93251762],
       [0.98976159, 0.01023841],
       [0.89083404, 0.10916596],
       [0.99043037, 0.00956963],
       [0.98073946, 0.01926054],
       [0.99033581, 0.00966419],
       [0.03209204, 0.96790796]])